package info.kgeorgiy.java.advanced.student;

import org.junit.FixMethodOrder;
import org.junit.Test;
import org.junit.runners.MethodSorters;

/**
 * Tests for hard version
 * of <a href="https://www.kgeorgiy.info/courses/java-advanced/homeworks.html#homework-student">Student</a> homework
 * for <a href="https://www.kgeorgiy.info/courses/java-advanced/">Java Advanced</a> course.
 *
 * @author Georgiy Korneev (kgeorgiy@kgeorgiy.info)
 */
@FixMethodOrder(MethodSorters.NAME_ASCENDING)
public class AdvancedStudentGroupQueryTest extends FullStudentGroupQueryTest {
    private final AdvancedStudentGroupQuery db = createCUT();

    @Test
    public void test31_testGetMostPopularName() {
        testString(
                db::getMostPopularName,
                "", "Дмитрий Наумов", "Даниил Свиридов", "Дмитрий Кузнецов", "Сергей Гусев", "Сергей Захаров", "Даниил Наумов", "Сергей Гусев", "Даниил Безбородов", "Сергей Свиридов", "Сергей Свиридов", "Сергей Свиридов", "Дмитрий Наумов", "Илья Кузнецов", "Никита Лебедев", "Сергей Гусев", "Никита Наумов", "Сергей Наумов", "Сергей Гусев", "Дмитрий Гусев", "Никита Лебедев", "Сергей Гусев", "Дмитрий Наумов", "Никита Захаров", "Сергей Захаров", "Сергей Гусев", "Никита Захаров", "Сергей Свиридов", "Никита Лебедев", "Никита Лебедев", "Сергей Наумов", "Сергей Наумов", "Даниил Безбородов", "Даниил Свиридов", "Сергей Захаров", "Сергей Наумов", "Владислав Кузнецов", "Илья Захаров", "Даниил Наумов", "Илья Кузнецов", "Сергей Наумов", "Сергей Наумов", "Сергей Лебедев", "Сергей Гусев", "Даниил Безбородов", "Сергей Гусев", "Никита Кузнецов", "Сергей Захаров", "Сергей Свиридов", "Даниил Свиридов", "Даниил Наумов", "Сергей Наумов", "Сергей Наумов", "Сергей Захаров", "Сергей Захаров", "Никита Лебедев", "Сергей Гусев", "Дмитрий Наумов", "Сергей Гусев", "Даниил Наумов", "Сергей Гусев", "Сергей Наумов", "Сергей Гусев", "Дмитрий Наумов", "Дмитрий Наумов", "Илья Захаров", "Даниил Безбородов", "Дмитрий Наумов", "Сергей Захаров", "Сергей Захаров", "Никита Наумов", "Сергей Гусев", "Сергей Захаров", "Дмитрий Наумов", "Дмитрий Наумов", "Сергей Гусев", "Даниил Наумов", "Дмитрий Наумов", "Сергей Гусев", "Дмитрий Наумов", "Сергей Наумов", "Дмитрий Наумов", "Сергей Захаров", "Дмитрий Наумов", "Даниил Наумов", "Дмитрий Наумов", "Сергей Захаров", "Сергей Гусев", "Илья Захаров", "Дмитрий Наумов", "Сергей Захаров", "Сергей Захаров", "Сергей Захаров", "Дмитрий Наумов", "Илья Захаров", "Сергей Гусев", "Сергей Захаров", "Дмитрий Наумов", "Сергей Гусев", "Сергей Гусев", "Дмитрий Наумов", "Дмитрий Наумов", "Сергей Захаров", "Сергей Гусев", "Сергей Гусев", "Сергей Захаров", "Сергей Захаров", "Сергей Захаров", "Сергей Захаров", "Сергей Гусев", "Сергей Захаров", "Сергей Гусев", "Дмитрий Наумов", "Дмитрий Наумов", "Сергей Захаров", "Дмитрий Наумов", "Сергей Захаров", "Сергей Захаров", "Сергей Захаров", "Сергей Захаров", "Илья Захаров", "Дмитрий Наумов", "Сергей Захаров", "Сергей Захаров", "Дмитрий Наумов", "Сергей Захаров", "Сергей Захаров", "Дмитрий Наумов", "Дмитрий Наумов", "Сергей Захаров", "Сергей Захаров", "Дмитрий Наумов", "Сергей Захаров", "Сергей Захаров", "Сергей Захаров", "Сергей Захаров", "Сергей Захаров", "Сергей Захаров", "Сергей Захаров", "Сергей Захаров"
        );
    }
}
